[
    {
        "speaker": "Narrator",
        "line": "Hello, everybody. So, as some of you know, my name is Ashley, if you're new to the channel, thanks for stopping by, um, I get a lot of questions about, like, just in day to day life about how I do day to day things, which I don't like it very exciting. It's pretty normal. So I just thought that I would kind of take you guys along with me for this. For today, it's evening now it's about four o'clock or so. So I have had, it's raining out today and kind of gross. So I've just really been listening to audiobooks, and I did some vacuuming and minimal, minimal things. So anyway, I decided to kind of do a vlog style video for you and kind of show you how I make supper. Which seems so weird to me. Because my husband even gets a lot of questions about whether he comes home at night and cook supper for us. And I thought, you know, I can tell people that I cook supper, all I want, but do people really believe me, so I thought, You know what, let's take you along for the boring journey of me cooking supper and you know, show you that I actually do do it. You know, Being blind doesn't necessarily mean that I can't cook or clean or do anything. And I thought I'd you know, give you a little glimpse into my life with three kids and husband and you know, being a stay at home mom. So here it is. And I will give out one dirty little secret. I was doing laundry today. And I thought you know, I always say that there's nothing I can't do and,"
    },
    {
        "speaker": "Narrator",
        "line": "and I thought there's one thing that I really struggle with when it comes to laundry, and I'll show you what it is now."
    },
    {
        "speaker": "Narrator",
        "line": "It is socks. So my husband gets the joy of"
    },
    {
        "speaker": "Narrator",
        "line": "couldn't get the joy of coming home. And pairing socks, I have a heck of a time with it. I know that there's methods you know, that I could use such as painting your socks together using all these little round rubber like clips to pin your socks together. But I have a hard time getting my kids to put their laundry in the laundry hamper. So I don't think that they're going to pair their socks, they put them into the laundry. So he does that for me I have done it. But sometimes he gets one black sock and one white sock because I can't feel the difference in color. So that is one thing that I either get my husband or my kids to help with. So that's one of my dirty little secrets that"
    },
    {
        "speaker": "Narrator",
        "line": "don't usually share. But so there's some things that obviously I need help with. But so anyway, yeah, I'll take you along for my little evening here."
    },
    {
        "speaker": "Narrator",
        "line": "Okay, so I'm in the kitchen now, and I'm just getting stuff set up. But I thought I'd show you a couple of things that I have in my kitchen that I use to"
    },
    {
        "speaker": "Narrator",
        "line": "help me to kind of cook and I guess be successful. There not a lot of adoption. In my kitchen, a lot of it is just you know, regular old digital appliances. So I'll just show you. So on my microwave, you can see that I have these orange, I think they're orange bumpit, they're on the, you know, most used button. So this one is the five, this is the quick minute and this is the defrost button. And then every other number has just a little piece of velcro underneath it and then I you know, have just memorized that timer is to this side. And believe it's clocked to this, I don't use it and then obviously, you know, stop and start a lot of it's done by memory, but I do have like some buttons kind of marked out just for ease and, and that kind of thing because it's flat, I can't necessarily feel where every number is. So rather than just guess I just put a little bit of Velcro on there and then"
    },
    {
        "speaker": "Narrator",
        "line": "take you over"
    },
    {
        "speaker": "Narrator",
        "line": "to my stove."
    },
    {
        "speaker": "Narrator",
        "line": "Turn the light here I don't have any lights on in my house because they don't help so. So on my stove, there's even less so just gonna give you a bigger view of it. On the top here is a puff paint line. So that just tells me that that is the front burner. And then on here, this is bake and then this is cancel and then this means like to turn the temperature up and I just know if I go straight down from this line and push. I'll go down and obviously the oven goes up by five so I have that memorized. And then I'm on here as well. There's just puff paint to show the front burner. The only thing that I struggle with with my stove is obviously this is glass top"
    },
    {
        "speaker": "Narrator",
        "line": "so it can sometimes be tricky to get the pot lined up. So, but I mean, I just use my hand and kind of, you know, check the sides for heat. But for the most part, it's you know, normal as everything else and in my pantry"
    },
    {
        "speaker": "Narrator",
        "line": "first of all, I can't believe that I'm showing people my disorganized mess of the pantry. But I just have things kind of organized. So like here I have my kids snacks, I have things in different bins."
    },
    {
        "speaker": "Narrator",
        "line": "And then all of my canned goods have"
    },
    {
        "speaker": "Narrator",
        "line": "a penfriend label on top. So what that is, is just like a re recordable label that I use. So I'll just show it to you here."
    },
    {
        "speaker": "Narrator",
        "line": "So this is the pen friends. So if you turn it on,"
    },
    {
        "speaker": "Narrator",
        "line": "on, I can."
    },
    {
        "speaker": "Narrator",
        "line": "I know that that's vegetable soup. So this report, I don't know which side the labels on, it will just tell me what these are. So when I buy them, I get my husband to tell me what they are before I put them away or the kids or even the store clerk. Oh, that's kind of one way. Those are just the few adaptions that I have in my kitchen. I do have a talking thermometer. I don't use it very often, I usually just use time. So those are the things that I have in my kitchen that are I guess adapted to me otherwise, everything just goes back in the exact same spot. And if it doesn't,"
    },
    {
        "speaker": "Narrator",
        "line": "I go searching for the kids and my husband and asked where the heck they put it. So that's really the only adaptions but um, so yeah, so I'm just gonna start making suffer now And okay, so I am going to make meatloaf for supper tonight meatloaf and potatoes. So I will just kind of make my supper and you can kind of follow along I guess so."
    },
    {
        "speaker": "Narrator",
        "line": "See that? Yes, I do cook supper and it does not matter that I can't see I'm very capable of cooking supper. So let's get started."
    },
    {
        "speaker": "Narrator",
        "line": "Okay, so now that I've turned on the lights and you can probably see a little bit better. I'm horrible for leaving the lights off in my house because I always forget that not everybody else was lined. Okay, so I'm just gonna grab the things that I need and bring it back I already have the ground beef in here thought out so"
    },
    {
        "speaker": "Narrator",
        "line": "onion, bread crumbs, onion soup mix and I just got those out of the countries again I know everything is."
    },
    {
        "speaker": "Narrator",
        "line": "NASA was rolling"
    },
    {
        "speaker": "Narrator",
        "line": "in here"
    },
    {
        "speaker": "Narrator",
        "line": "Okay so"
    },
    {
        "speaker": "Narrator",
        "line": "this onion here cut it up small so the kids don't know it's at night"
    },
    {
        "speaker": "Narrator",
        "line": "so hopefully they're not listening to me feel"
    },
    {
        "speaker": "Narrator",
        "line": "what"
    },
    {
        "speaker": "Narrator",
        "line": "did you hear me my son hurt me"
    },
    {
        "speaker": "Narrator",
        "line": "okay"
    },
    {
        "speaker": "Narrator",
        "line": "here"
    },
    {
        "speaker": "Narrator",
        "line": "picture"
    },
    {
        "speaker": "Narrator",
        "line": "piece over here"
    },
    {
        "speaker": "Narrator",
        "line": "so I think a lot of people think that you know just because we can't see that we don't you know like use knives or anything like that and I don't think that that's necessarily true because"
    },
    {
        "speaker": "Narrator",
        "line": "we have to eat and so having the skills to cook and do all those things are just you know life skills that people need to have and it can be done I mean obviously if you use common sense keep your fingers on the leg and I mean I've cut myself but I think you know I've cited friends who have cut themselves my husband does cut himself so"
    },
    {
        "speaker": "Narrator",
        "line": "in this bowl here"
    },
    {
        "speaker": "Narrator",
        "line": "whoops and straps on the floor"
    },
    {
        "speaker": "Narrator",
        "line": "we will clean up dog here on my feet our pet dog is just she always sits right beside me she knows I drop things"
    },
    {
        "speaker": "Narrator",
        "line": "okay"
    },
    {
        "speaker": "Narrator",
        "line": "this stuff"
    },
    {
        "speaker": "Narrator",
        "line": "I don't mind cooking I like it I utilize it lots of times for Christmas and Easter and Thanksgiving and all those things I cook the meals and"
    },
    {
        "speaker": "Narrator",
        "line": "for you know, the whole family sometimes both sides of the family and I enjoy it I think you know, I like having people over cooking for them and"
    },
    {
        "speaker": "Narrator",
        "line": "you know, hopefully taste good but I enjoy it so I don't mind"
    },
    {
        "speaker": "Narrator",
        "line": "I don't mind doing it and I'm glad that I'm able to do it. You know"
    },
    {
        "speaker": "Narrator",
        "line": "I wouldn't would not like if I had to"
    },
    {
        "speaker": "Narrator",
        "line": "rely on my husband to do all the cooking I don't think that that's fair to him and I don't I wouldn't like that I'm not that type of person. I like to be independent and I want to do things that everybody else does and I don't think there's any reason why I shouldn't be able to"
    },
    {
        "speaker": "Narrator",
        "line": "so you know how smell it makes sure that it smells the way that it's supposed to. It's kind of how I go about it."
    },
    {
        "speaker": "Narrator",
        "line": "Okay."
    },
    {
        "speaker": "Narrator",
        "line": "Oh, I forgot to take my rings off."
    },
    {
        "speaker": "Narrator",
        "line": "Can"
    },
    {
        "speaker": "Narrator",
        "line": "bowling"
    },
    {
        "speaker": "Narrator",
        "line": "make many open little ones because it"
    },
    {
        "speaker": "Narrator",
        "line": "cooks faster."
    },
    {
        "speaker": "Narrator",
        "line": "One more so is."
    },
    {
        "speaker": "Narrator",
        "line": "So these up here"
    },
    {
        "speaker": "Narrator",
        "line": "I'm just gonna grab some potatoes."
    },
    {
        "speaker": "Narrator",
        "line": "So after I've cleaned up my mess from dropping a bag of potatoes from the garden with dirt everywhere"
    },
    {
        "speaker": "Narrator",
        "line": "I'm just going to peel up my potatoes, cut them up in pots, yes, again, I can feel potatoes, I like to just put your towel here and then my public pot over here and then I can just kind of pick this up with all of the potato peels really not a blind thing. It's just a clean free thing. So penalized potatoes just like everybody else I just feel for the skin and where it is keep my hand out of the way and if I take more potatoes I shared with the appeal then whatever happens not big deal."
    },
    {
        "speaker": "Narrator",
        "line": "Just peel these all up here"
    },
    {
        "speaker": "Narrator",
        "line": "I prefer to use a knife I just find it faster than a potato peeler. And yeah, so I just find it easier. So"
    },
    {
        "speaker": "Narrator",
        "line": "make sure we get most of the peel off there's someone there still"
    },
    {
        "speaker": "Narrator",
        "line": "that's fine."
    },
    {
        "speaker": "Narrator",
        "line": "It is what it is."
    },
    {
        "speaker": "Narrator",
        "line": "Okay"
    },
    {
        "speaker": "Narrator",
        "line": "I have three growing kids so we go through a lot of potatoes so cut these up here"
    },
    {
        "speaker": "Narrator",
        "line": "Okay, so I'm just gonna appeal to these potatoes and then I'll be right back. Okay, so now that I've gotten all the potatoes peeled, I'm just gonna cut them all been put them in the box here so"
    },
    {
        "speaker": "Narrator",
        "line": "figure nine here"
    },
    {
        "speaker": "Narrator",
        "line": "so it's definitely not an exact"
    },
    {
        "speaker": "Narrator",
        "line": "science. You're cutting them up for mashed potatoes"
    },
    {
        "speaker": "Narrator",
        "line": "very exciting stuff."
    },
    {
        "speaker": "Narrator",
        "line": "Watching me cut potatoes. So I'll finish cutting these potatoes and then I'll be right back."
    },
    {
        "speaker": "Narrator",
        "line": "Okay, so now I've got my potatoes all cut up here."
    },
    {
        "speaker": "Narrator",
        "line": "Just going to fill up the foreign firm stove. Okay, got the water in there"
    },
    {
        "speaker": "Narrator",
        "line": "so what I do, since this is a glass top stove and it's hard to tell where the burners are, I will turn the burner on. And then I'll place the pot on are just going to tuck this meatloaf just gonna put this neat little fan so to turn this on"
    },
    {
        "speaker": "Narrator",
        "line": "to some fun"
    },
    {
        "speaker": "Narrator",
        "line": "contests and here"
    },
    {
        "speaker": "Narrator",
        "line": "Okay, so good do this pot is going to suffer."
    },
    {
        "speaker": "Narrator",
        "line": "Turn it on, and then when it gets hot"
    },
    {
        "speaker": "Narrator",
        "line": "I can kind of feel where the burner is and then I'll check around"
    },
    {
        "speaker": "Narrator",
        "line": "the pot, make sure that it's on there."
    },
    {
        "speaker": "Narrator",
        "line": "And that's it. So that's how I could suffer in no respect of not having this will be a 30 minute video."
    },
    {
        "speaker": "Narrator",
        "line": "I'm going to end it here, but it kind of gives you a little bit of a glimpse into how I cook supper and how I go about it. And yes, I do cook supper. So if you have any other questions, please leave them in the comments below. And I will try my hardest to answer them. So thanks for watching."
    }
]